In [12]:
import pandas as pd
import numpy as np

In [48]:
train = pd.read_csv("./data/train.csv")
print(train.columns)

Index(['id', 'keyword', 'location', 'text', 'target'], dtype='object')

In [50]:
# Balanced target
train.target.value_counts(normalize=True)

target
0    0.57034
1    0.42966
Name: proportion, dtype: float64

In [62]:
# Check null proportion of keyword and location
print(train.keyword.isna().value_counts(normalize=True))
print(train.location.isna().value_counts(normalize=True))

keyword
False    0.991987
True     0.008013
Name: proportion, dtype: float64
location
False    0.66728
True     0.33272
Name: proportion, dtype: float64

In [59]:

train[train.keyword.isna()]

,id,keyword,location,text,target
0,1,NaN,NaN,Our Deeds are the Reason of this #earthquake M...,1
1,4,NaN,NaN,Forest fire near La Ronge Sask. Canada,1
2,5,NaN,NaN,All residents asked to 'shelter in place' are ...,1
3,6,NaN,NaN,"13,000 people receive #wildfires evacuation or...",1
4,7,NaN,NaN,Just got sent this photo from Ruby #Alaska as ...,1
...,...,...,...,...,...
7608,10869,NaN,NaN,Two giant cranes holding a bridge collapse int...,1
7609,10870,NaN,NaN,@aria_ahrary @TheTawniest The out of control w...,1
7610,10871,NaN,NaN,M1.94 [01:04 UTC]?5km S of Volcano Hawaii. htt...,1
7611,10872,NaN,NaN,Police investigating after an e-bike collided ...,1
7612,10873,NaN,NaN,The Latest: More Homes Razed by Northern Calif...,1

In [47]:
train.groupby(['keyword'])['id'].count().reset_index().rename(columns = {'id':'keyword_'})

        keyword  target  keyword_
0        ablaze       0        23
1        ablaze       1        13
2      accident       0        11
3      accident       1        24
4    aftershock       0        34
..          ...     ...       ...
433       wreck       0        30
434       wreck       1         7
435    wreckage       1        39
436     wrecked       0        36
437     wrecked       1         3

[438 rows x 3 columns]

In [46]:
train.groupby(['location'])['id'].count().reset_index().rename(columns = {'id':'location_'})

                    location  location_
0                                     1
1                   Glasgow           1
2       Melbourne, Australia          1
3                       News          1
4                        Ã¥_           1
...                      ...        ...
3336         Ã¥_: ?? ÃŒÃ‘ ? : ?          1
3337    Ã¥_Ã¥_Los Mina CityÂ‰Ã£Â¢          1
3338      Ã¥Â¡Ã¥Â¡Midwest Â‰Ã›Â¢Â‰Ã›Â¢          1
3339       Ã¥ÃŠ(?Â‰Ã›Â¢`?Â‰Ã›Â¢Ã¥Â«)??          1
3340             Ã¥Ã¸\_(?)_/Ã¥Ã¸          1

[3341 rows x 2 columns]

`count()`: Counts non-null values in the specified column.
`size()`: Counts all rows, including those with NaN values.

In [37]:
train.groupby(['keyword','location'])['id'].count().reset_index().rename(columns = {'id':'events'})

      keyword           location  events
0      ablaze             AFRICA       1
1      ablaze              Abuja       1
2      ablaze            Anaheim       1
3      ablaze           Barbados       1
4      ablaze         Birmingham       2
...       ...                ...     ...
4652  wrecked     Santa Cruz, CA       1
4653  wrecked                 TN       1
4654  wrecked      United States       2
4655  wrecked  Vancouver, Canada       1
4656  wrecked  probably not home       1

[4657 rows x 3 columns]

In [38]:
train.groupby(['keyword','location'])['id'].size().reset_index().rename(columns = {'id':'events'})

      keyword           location  events
0      ablaze             AFRICA       1
1      ablaze              Abuja       1
2      ablaze            Anaheim       1
3      ablaze           Barbados       1
4      ablaze         Birmingham       2
...       ...                ...     ...
4652  wrecked     Santa Cruz, CA       1
4653  wrecked                 TN       1
4654  wrecked      United States       2
4655  wrecked  Vancouver, Canada       1
4656  wrecked  probably not home       1

[4657 rows x 3 columns]